goal_setter/app/models/user.rb

  def reset_session_token
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6LeiMLQDCeDNLtdZLxKr1A"], ["updated_at", "2018-11-16 22:02:53.387647"], ["id", 1]]